{"tags":[{"id":7559,"name":"When","slug":"when","tags":[{"id":61786,"name":"Upcoming","slug":"upcoming","hidden":false},{"id":61787,"name":"Past","slug":"past","hidden":false}],"hidden":false},{"id":7558,"name":"Country","slug":"country","tags":[{"id":40,"name":"Austria","slug":"austria","hidden":false},{"id":56,"name":"Belgium","slug":"belgium","hidden":false},{"id":191,"name":"Croatia","slug":"croatia","hidden":false},{"id":203,"name":"Czechia","slug":"czechia","hidden":false},{"id":250,"name":"France","slug":"france","hidden":false},{"id":276,"name":"Germany","slug":"germany","hidden":false},{"id":300,"name":"Greece","slug":"greece","hidden":false},{"id":348,"name":"Hungary","slug":"hungary","hidden":false},{"id":372,"name":"Ireland","slug":"ireland","hidden":false},{"id":440,"name":"Lithuania","slug":"lithuania","hidden":false},{"id":528,"name":"Netherlands","slug":"netherlands","hidden":false},{"id":616,"name":"Poland","slug":"poland","hidden":false},{"id":620,"name":"Portugal","slug":"portugal","hidden":false},{"id":724,"name":"Spain","slug":"spain","hidden":false},{"id":756,"name":"Switzerland","slug":"switzerland","hidden":false}],"hidden":false}],"items":[{"id":8707,"name":"Kicking off the planting season in Limburg with BLG!","slug":"Kicking-off-the-planting-season-in-Limburg-with-BLG!","tags":[61787,61807,528],"fields":{"lat":51.54898185296815,"date":"20-11-2024","long":6.022360741643017,"open":"Closed Event","host-name":"Stichting Life Terra","event-name":"Kicking off the planting season in Limburg with BLG!","country-code":"NL","event_details":"<p>We will be planting trees with our partner BLG at Landgoed Geijsteren in Limburg. Our morning event will start with an introduction to reforestation and it's importance in fighting climate change, which we will conduct together with our planting partner Bosgroepen. Afterwards we will spend the rest of the morning to help Landgoed Geijsteren with their tree planting project!</p>","subscription_instructions":"<p></p>"}},{"id":8708,"name":"Morning tree planting in Limburg with Politie Nederland  ","slug":"Morning-tree-planting-in-Limburg-with-Politie-Nederland--","tags":[61787,61807,528],"fields":{"lat":51.54898185296815,"date":"21-11-2024","long":6.022360741643017,"open":"Closed Event","host-name":"Stichting Life Terra","event-name":"Morning tree planting in Limburg with Politie Nederland  ","country-code":"NL","event_details":"<p>Durhing this morning event we will be planting trees together with Politie Nederland at Landgoed Geijsteren in Limburg. Our event will start with an introduction to reforestation and it's importance in fighting climate change, which we will conduct together with our planting partner Bosgroepen. Afterwards we will spend the rest of the morning to help Landgoed Geijsteren with their tree planting project!</p>","subscription_instructions":"<p></p>"}},{"id":8710,"name":"Afternoon tree planting in Limburg with Politie Nederland","slug":"Afternoon-tree-planting-in-Limburg-with-Politie-Nederland","tags":[61787,61807,528],"fields":{"lat":51.54898185296815,"date":"21-11-2024","long":6.022360741643017,"open":"Closed Event","host-name":"Stichting Life Terra","event-name":"Afternoon tree planting in Limburg with Politie Nederland","country-code":"NL","event_details":"<p>Durhing this afternoon event we will be planting trees together with Politie Nederland at Landgoed Geijsteren in Limburg. Our event will start with an introduction to reforestation and it's importance in fighting climate change, which we will conduct together with our planting partner Bosgroepen. Afterwards we will spend the rest of the afternoon to help Landgoed Geijsteren with their tree planting project!</p>","subscription_instructions":"<p></p>"}},{"id":8711,"name":"Morning tree planting event with EY ","slug":"Morning-tree-planting-event-with-EY-","tags":[61787,61807,528],"fields":{"lat":51.91012949666751,"date":"28-11-2024","long":5.215980987980487,"open":"Closed Event","host-name":"Stichting Life Terra","event-name":"Morning tree planting event with EY ","country-code":"NL","event_details":"<p>During this morning event with EY we will be restoring an area that used to be monoculture forest and that was devastated by disease. We will start with an introduction on reforestation, why it is important and why we need to create a biodiverse forest on this location specifically. Afterwards, we will be working the rest of the morning to help create this new forest!</p>","subscription_instructions":"<p></p>"}},{"id":8713,"name":"Afternoon tree planting event with EY","slug":"Afternoon-tree-planting-event-with-EY","tags":[61787,61807,528],"fields":{"lat":51.91012949666751,"date":"28-11-2024","long":5.215980987980487,"open":"Closed Event","host-name":"Stichting Life Terra","event-name":"Afternoon tree planting event with EY","country-code":"NL","event_details":"<p>During this afternoon event with EY we will be restoring an area that used to be monoculture forest and that was devastated by disease. We will start with an introduction on reforestation, why it is important and why we need to create a biodiverse forest on this location specifically. Afterwards, we will be working the rest of the afternoon to help create this new forest!</p>","subscription_instructions":"<p></p>"}},{"id":8714,"name":"Planting trees with Tulpenrallye at Mariënwaerdt","slug":"Planting-trees-with-Tulpenrallye-at-Marienwaerdt","tags":[61787,61807,528],"fields":{"lat":51.91012949666751,"date":"30-11-2024","long":5.215980987980487,"open":"Closed Event","host-name":"Stichting Life Terra","event-name":"Planting trees with Tulpenrallye at Mariënwaerdt","country-code":"NL","event_details":"<p>During this event with Tulpenrallye we will be restoring an area that used to be monoculture forest and that was devastated by disease. We will start with an introduction on reforestation, why it is important and why we need to create a biodiverse forest on this location specifically. Afterwards, we will be working the rest of the morning to help create this new forest!</p>","subscription_instructions":"<p></p>"}},{"id":8719,"name":"Big Family Planting in Las Rozas 2024","slug":"Big-Family-Planting-in-Las-Rozas-2024","tags":[61787,61807,724],"fields":{"lat":40.50441833539093,"date":"19-10-2024","long":-3.8831086043634695,"open":"Open Event","host-name":"Stichting Life Terra","event-name":"Big Family Planting in Las Rozas 2024","country-code":"ES","event_details":"<p>The first open event of the European Tree Planting Day was a massive success! Around 1200 people participated not only in the ecological restoration of the area, but could also enjoy the cultural shows and environmental workshops that were held by the Las Rozas City Hall.</p><p></p><p>Our fourth year of collaboration in a row, and making it more successfull and unique every time! Thanks to all participants and the Las Rozas municipality for the amazing job!</p>","subscription_instructions":"<p>People can join freely by attending the event during the designated hours. It starts at 10:00am and lasts for around 5 hours. Find more information in the Las Rozas Municipality webpage: https://www.lasrozas.es/node/10799</p>"}},{"id":8720,"name":"Training young Terra Leaders in Las Rozas","slug":"Training-young-Terra-Leaders-in-Las-Rozas","tags":[61787,61807,724],"fields":{"lat":40.50441833539093,"date":"19-10-2024","long":-3.8831086043634695,"open":"Closed Event","host-name":"Stichting Life Terra","event-name":"Training young Terra Leaders in Las Rozas","country-code":"ES","event_details":"<p>The planting activity was a great success! A sunny day was the perfect environment to train these young volunteers, who assisted the Great Family Planting of Las Rozas 2024 and helped not only to pleant but also to tag the trees. </p><p></p><p>Great job! We hope to see you again in the field soon.</p>","subscription_instructions":"<p></p>"}},{"id":8721,"name":"Planting with the Green Helmets Project in Las Rozas","slug":"Planting-with-the-Green-Helmets-Project-in-Las-Rozas","tags":[61787,61807,724],"fields":{"lat":40.50441833539093,"date":"21-11-2024","long":-3.8831086043634695,"open":"Closed Event","host-name":"Stichting Life Terra","event-name":"Planting with the Green Helmets Project in Las Rozas","country-code":"ES","event_details":"<p>On Thursday 21 November, Cascos Verdes (Green Helmets) and employees from Amazon and Amazon Web Services gathered in Las Rozas, Madrid, to plant 150 trees and shrubs to restore the Dehesa de Navalcarbón.</p><p></p><p>The planting took place alongside a local school, Colegio Zola, where employees and students learned not only about planting but also about local species and the importance of caring for the environment.</p><p></p><p>The Green Helmets initiative aims to reforest and carry out work to improve the forest environment after the 2021 fires in Andalusia, south of Spain. Now, they are also expanding their reforestation efforts across the country.</p><p></p><p>We enjoyed the enthusiasm and energy of the Amazon employees, who, divided into groups, did amazing work hand in hand with the students.</p><p></p><p>At the end of the activity, and because we still had some time left, participants also learned about an insect hotel that is placed next to the planting site, which will help to attract pollinators and foster a healthier ecosystem around it.</p><p></p><p>We hope this will be the first of many collaborations!</p>","subscription_instructions":"<p></p>"}},{"id":8722,"name":"Adyen Paris tree planting event","slug":"Adyen-Paris-tree-planting-event","tags":[61787,61807,250],"fields":{"lat":48.540462352429714,"date":"27-11-2024","long":2.0475674756351796,"open":"Closed Event","host-name":"Stichting Life Terra","event-name":"Adyen Paris tree planting event","country-code":"FR","event_details":"<p>Life Terra now offers the unique opportunity to plant trees close to Paris. The 14th century castle “Ferme de Chateaupers” in Roinville is the venue where we'll be planting nearly 5,000 trees to help restore the land. The goal of the events is to plant a diverse mix of plant species inside and around the farm’s boundaries, as well as in some crop-field margins, to create windbreaks, biodiversity hubs, and new orchards. </p><p></p><p>The plantings will also be used to create “green infrastructure” to connect different pockets of forest and thus reconnect habitats. This will reinforce local biodiversity and enhance the resilience of the local ecosystem to extreme climatic events.</p><p></p><p>We'll kick off this project with the help of Adyen's Paris team, making France the 6th country (after Netherlands, Spain, Italy, UK and Sweden) for this internationally operating payment platform specialist. Let's plant!</p>","subscription_instructions":"<p></p>"}},{"id":8723,"name":"NVIDIA Tree Planting Day","slug":"NVIDIA-Tree-Planting-Day","tags":[61787,61807,276],"fields":{"lat":48.02409258284375,"date":"22-11-2024","long":11.63992552777543,"open":"Closed Event","host-name":"Stichting Life Terra","event-name":"NVIDIA Tree Planting Day","country-code":"DE","event_details":"<p>We are going to restore a forest area in order to contribute to Germany's ongoing silviculture conversion towards stronger climate resiliency. At this specific event, NVIDIANs from the Munich office have the opportunity to be part of Life Terra’s mission, planting trees with their colleagues and making a direct positive impact.</p>","subscription_instructions":"<p></p>"}},{"id":8725,"name":"One Tree Planted event with DLL near Den Bosch ","slug":"One-Tree-Planted-event-with-DLL-near-Den-Bosch-","tags":[61786,61807,528],"fields":{"lat":51.720485588871895,"date":"19-12-2024","long":5.38940006031182,"open":"Closed Event","host-name":"Stichting Life Terra","event-name":"One Tree Planted event with DLL near Den Bosch ","country-code":"NL","event_details":"<p></p>","subscription_instructions":"<p></p>"}},{"id":8762,"name":"Avenue of Freedom'24","slug":"Avenue-of-Freedom'24","tags":[61787,61807,203],"fields":{"lat":50.589331149523424,"date":"09-11-2024","long":16.29342805100887,"open":"Closed Event","host-name":"Nadace Partnerství","event-name":"Avenue of Freedom'24","country-code":"CZ","event_details":"<p>The new Avenue of Freedom was established on Saturday, November 9th, in the Broumov region, where persecution of clergy from all over Czechoslovakia was concentrated during the previous communist regime. In the 1950s, an internment camp for priests and monks from various orders was set up in the local Benedictine monastery. By planting the Avenue of Freedom, we commemorated the past and expressed our respect for those who suffered and fought for our freedom.</p><p></p><p>The event is organized within the project „Planting Our Future”, supported by the International Visegrad Fund. Its aim is to exchange knowledge and experience in the field of tree planting and tree care programs in Poland, the Czech Republic and Slovakia.</p><p></p><p>Project partners: Fundusz Partnerstwa, Klub Gaja (Poland), Nadace Partnerství (Czechia), Nadácia Ekopolis (Slovakia).</p><p></p><p>The planting of the Avenue of Freedom takes place as part of the European Tree Planting Day initiative, which aims to unite communities, schools and environmental organisations across Europe to plant trees.</p><p></p><p>Initiative partners:  Life Terra Foundation (Netherlands), Nadace Partnerství (Czechia).</p>","subscription_instructions":"<p></p>"}},{"id":8775,"name":"ABN AMRO tree planting event at Mariënwaerdt","slug":"ABN-AMRO-tree-planting-event-at-Marienwaerdt","tags":[61787,61807,528],"fields":{"lat":51.91012949666751,"date":"27-11-2024","long":5.215980987980487,"open":"Closed Event","host-name":"Stichting Life Terra","event-name":"ABN AMRO tree planting event at Mariënwaerdt","country-code":"NL","event_details":"<p>During this event ABN AMRO will be planting trees at the beautiful estate of Mariënwaerdt. After an introduction on how to plant a tree and why it is important to plant a tree, the ABN AMRO employees will be helping to reforest an area that has been devastated by ash die-back. By planting a mix of endemic species, the area will restore more quickly and be more resilient to such deceases in future.</p>","subscription_instructions":"<p></p>"}},{"id":8778,"name":"Planting trees with Heimstaden at Mariënwaerdt","slug":"Planting-trees-with-Heimstaden-at-Marienwaerdt","tags":[61787,61807,528],"fields":{"lat":51.91012949666751,"date":"27-11-2024","long":5.215980987980487,"open":"Closed Event","host-name":"Stichting Life Terra","event-name":"Planting trees with Heimstaden at Mariënwaerdt","country-code":"NL","event_details":"<p>During this event Heimstaden will be planting trees at the beautiful estate of Mariënwaerdt. After an introduction on how to plant a tree and why it is important to plant a tree, the Heimstaden employees will be helping to reforest an area that has been devastated by ash die-back. By planting a mix of endemic species, the area will restore more quickly and be more resilient to such deceases in future.</p>","subscription_instructions":"<p></p>"}},{"id":8783,"name":"Ecological restoration continues in Santa Clara a Velha","slug":"Ecological-restoration-continues-in-Santa-Clara-a-Velha","tags":[61786,61807,620],"fields":{"lat":37.563689004135156,"date":"13-12-2024","long":-8.47153559873475,"open":"Closed Event","host-name":"Stichting Life Terra","event-name":"Ecological restoration continues in Santa Clara a Velha","country-code":"PT","event_details":"<p>The Ecological Restoration of Santa Clara a Velha area, Odemira Municipality (Portugal), has been active since 2022. As of today more than 80 hectares have been restored with over 65.000 native trees!</p><p></p><p>This former exhausted eucalyptus monoculture is being transformed into a biodiverse food forest using a mixture of native species and allowing natural regeneration to happen, while creating local job opportunities.</p><p></p><p>The local fauna seems to enjoy it as well, as wildhogs have been actively eating the first pine nuts and wild strawberries. It is foreseen to plant 7.500 extra plants to make up for the damage these animals have caused. </p><p></p><p>The fact that local fauna is attracted to the new ecological niche is a great indicator of success, but we have to keep taking care of the trees during their first years. Lets remember that maintenance is as important as a proper implementation effort!</p>","subscription_instructions":"<p></p>"}},{"id":8814,"name":"Viada Myliu miska planting","slug":"Viada-Myliu-miska-planting","tags":[61787,61807,440],"fields":{"lat":54.70146033005049,"date":"11-10-2024","long":25.357375819366812,"open":"Closed Event","host-name":"Myliu mišką","event-name":"Viada Myliu miska planting","country-code":"LT","event_details":"<p>Myliu Miską is organising a tree planting event to help green our local area and promote environmental sustainability! Together, we’ll plant trees, restore nature, and make a lasting positive impact for future generations.</p>","subscription_instructions":"<p></p>"}},{"id":8817,"name":"Tree Planting at Naranjas del Carmen organic farm","slug":"Tree-Planting-at-Naranjas-del-Carmen-organic-farm","tags":[61787,61807,724],"fields":{"lat":39.71418486589667,"date":"04-11-2024","long":-0.6594081500032815,"open":"Closed Event","host-name":"Stichting Life Terra","event-name":"Tree Planting at Naranjas del Carmen organic farm","country-code":"ES","event_details":"<p>The professional team of Naranjas del Carmen, an organic farm near Valencia, will plant a mixture of trees and shrubs to diversify the existing species and boost agrodiversity and biodiversity. This initiative aims to implement regenerative agriculture practices to enhance resilient ecosystems within and around the farm.</p>","subscription_instructions":"<p></p>"}},{"id":8828,"name":"Miyawaki Forest Planting, ELTE Dormitory Nagytétényi út","slug":"Miyawaki-Forest-Planting,-ELTE-Dormitory-Nagytetenyi-ut","tags":[61787,61807,348],"fields":{"lat":47.40908441126327,"date":"19-10-2024","long":19.01686759408436,"open":"Open Event","host-name":"10 Millió Fa Alapítvány","event-name":"Miyawaki Forest Planting, ELTE Dormitory Nagytétényi út","country-code":"HU","event_details":"<p>It was a wonderful day and a successful planting done in about 3 hours, it was uplifting to see the large number of participants, the wide range of ages, each well represented, there were many young children who will be the beneficiaries of these plants the decades to come. </p>","subscription_instructions":"<p>https://www.facebook.com/events/1441098686587456/?acontext=%7B%22event_action_history%22%3A[]%7D</p>"}},{"id":8839,"name":"Mapletree planting event near Warsaw","slug":"Mapletree-planting-event-near-Warsaw","tags":[61787,61807,616],"fields":{"lat":52.43418000594158,"date":"07-11-2024","long":20.73456605850206,"open":"Closed Event","host-name":"Stichting Life Terra","event-name":"Mapletree planting event near Warsaw","country-code":"PL","event_details":"<p>During our first collaboration with Mapletree in Poland, we've planted 1000 trees near the Narew river, close to Warsaw! This new riparian forest will increase the biodiversity on the flood plane close to the river, as we've planted 5 native species that are adapted to thriving in wet conditions. This new forest will become part of Mapletree's European reforestation efforts, together with our planting projects in the UK and the Netherlands!</p>","subscription_instructions":"<p></p>"}},{"id":8849,"name":"ADAX","slug":"ADAX","tags":[61787,61807,440],"fields":{"lat":55.718485312552055,"date":"18-10-2024","long":24.306464390765814,"open":"Closed Event","host-name":"Myliu mišką","event-name":"ADAX","country-code":"LT","event_details":"<p>The Adax team joined us with incredible enthusiasm, bringing positive energy and a strong spirit for a day of planting in the forest. From the very start, everyone immersed themselves in the experience, sharing laughs, enjoying the fresh air, and working together to plant 600 birch trees—a fantastic contribution to our mission! After the hard work, we gathered for tea and cookies, savoring a warm, cozy break in the heart of nature. It was truly inspiring to see such teamwork and dedication, and we’re beyond grateful for their support. We can’t wait to welcome the Adax team back next year to continue growing this forest together!</p>","subscription_instructions":"<p></p>"}},{"id":8850,"name":"MIYA forest e.V. Tiny Forest in Rüsselsheim, Germany","slug":"MIYA-forest-eV-Tiny-Forest-in-Russelsheim,-Germany","tags":[61787,61807,276],"fields":{"lat":49.988558442545425,"date":"04-12-2024","long":8.449755495724625,"open":"Open Event","host-name":"MIYA forest e.V.","event-name":"MIYA forest e.V. Tiny Forest in Rüsselsheim, Germany","country-code":"DE","event_details":"<p>We will plant a high-diverse Tiny Forest in Rüsselsheim with about 660 native trees and shrubs on an area of about 220 sqm. </p><p>Together with children from the nearby school, their parents, teachers and other volunteers we gonna have a great planting day!</p><p>Start is 8.30 am and it goes until the last tree is planted, so maybe until 5.30 pm.</p>","subscription_instructions":"<p>If you want to participate please write an email to info@miya-forest.de with the subject \"Tiny Forest in Rüsselsheim\". We will then provide you with all the necessary information :)</p>"}},{"id":8919,"name":"there for trees - Planting with kids in Domat/Ems","slug":"there-for-trees---Planting-with-kids-in-Domat/Ems","tags":[61787,61807,756],"fields":{"lat":46.827973006973444,"date":"28-10-2024","long":9.415985090069489,"open":"Closed Event","host-name":"There for you","event-name":"there for trees - Planting with kids in Domat/Ems","country-code":"CH","event_details":"<p>In beautiful weather, the children took part in a special planting day, where trees were planted, and climate action was discussed. The entire event unfolded in a joyful atmosphere—with many beaming children excited to get involved. All plants were successfully set in the ground, and each child had the opportunity to actively participate. The teacher was especially pleased, witnessing the children's enthusiasm, and at the end, expressed her excitement about making this an annual event. It was an inspiring day that brought young people closer to nature conservation, one they will hopefully remember for a long time.</p>","subscription_instructions":"<p></p>"}},{"id":8921,"name":"España","slug":"Espana","tags":[61787,61807,724],"fields":{"lat":40.15202771803477,"date":"16-10-2024","long":-3.6269085422931915,"open":"Closed Event","host-name":"Ecoescuelas","event-name":"España","country-code":"ES","event_details":"<p>Cada árbol ha sido plantado por un grupo de 3º de primaria (participaron un total de 85 alumn@s, 25 por cada árbol, más los 4 tutores y la responsable del proyecto medioambiental). Además contamos con la colaboración del alumnado mayor, de 6º, que prepararon el terreno (15 alumn@s).</p><p></p><p>Los árboles se adquirieron en un Vivero cercano. Se dejaron un par de días en nuestro invernadero, para luego pasar a la plantación.</p><p>En el aula, cada grupo fue informado de lo que iba a plantar, y dónde.</p><p>Ya in situ, se hizo hincapié en el procedimiento práctico en sí, como tener en cuenta distancia entre ejemplares, riego del terreno, el alcorque, etc etc.</p><p></p><p>Una vez plantado, se informa de los cuidados, frecuencia de riego, cuándo puede dar frutos, etc..</p><p></p><p>En resumen, esta es la 1ª plantación de 4 frutales en el interior del centro (huerto de primaria), con el nivel de 3º implicado (85 alumn@s aprox), y otros de 6º en la preparación del terreno. (15 alumn@s de 6º). 100 alumn@s movilizados en esta intervención.</p><p></p><p></p><p></p>","subscription_instructions":"<p></p>"}},{"id":8923,"name":"Planting with students at the Vicente Aleixandre High School","slug":"Planting-with-students-at-the-Vicente-Aleixandre-High-School","tags":[61787,61807,724],"fields":{"lat":40.25112195216072,"date":"30-10-2024","long":-3.6929066048783747,"open":"Closed Event","host-name":"Ecoescuelas","event-name":"Planting with students at the Vicente Aleixandre High School","country-code":"ES","event_details":"<p>La plantación se ha realizado con alumnos de 4º de la ESO pertenecientes a la materia de PROYECTO científico que está impartida por los departamentos de Biología y Geología  y Física y Quimica del centro.</p><p>Los alumnos y alumnas fueron muy participativos y se han plantado unos árboles que ellos y ellas van a poder ver crecer y cuidar puesto que se encuentran dentro del recinto del IES.</p>","subscription_instructions":"<p></p>"}},{"id":8924,"name":"MYBLUEPLANET Community Day","slug":"MYBLUEPLANET-Community-Day","tags":[61787,61807,756],"fields":{"lat":47.55217058775032,"date":"09-11-2024","long":8.77733488091923,"open":"Open Event","host-name":"MYBLUEPLANET","event-name":"MYBLUEPLANET Community Day","country-code":"CH","event_details":"<p>Our group helped the local nature association to plant this hedge in an agricultural area where biodiversity is usually very low. Children, adults, parents, friends and elderly people joined forces and planted these shrubs with a lot of fun and in record time!</p>","subscription_instructions":"<p>15</p>"}},{"id":8935,"name":"Agora Portals International School planting tree day!!","slug":"Agora-Portals-International-School-planting-tree-day!!","tags":[61787,61807,724],"fields":{"lat":39.534305615033695,"date":"29-10-2024","long":2.564079093345821,"open":"Closed Event","host-name":"Ecoescuelas","event-name":"Agora Portals International School planting tree day!!","country-code":"ES","event_details":"<p>Today, our two classes of 5-year-old students arrived at the designated planting area near the entrance of our school, so we expect them to show their parents and show them their tree.  </p><p>They were thrilled to see our gardener, Juanma, prepared with the trees, soil, gloves, shovels, watering cans, and everything needed for the planting activity. </p><p></p><p>Once there, we asked the children why trees are so important and what they need to live. A variety of enthusiastic answers emerged: “They need water,” “They give us fruit”, “They don’t like plastic,” and “They clean the air.” </p><p></p><p>After this discussion, all the students helped Juanma by adding soil around the trees and stamping the ground to keep it firm. Some even picked up bits of litter they found nearby, proudly declaring that the trees wouldn’t like that. It was a wonderful day of learning and teamwork, and we can’t wait to watch our trees grow!</p>","subscription_instructions":"<p></p>"}},{"id":8937,"name":"Plantación en FR","slug":"Plantacion-en-FR","tags":[61787,61807,724],"fields":{"lat":40.48460715938631,"date":"29-11-2024","long":-3.729645563626328,"open":"Closed Event","host-name":"Ecoescuelas","event-name":"Plantación en FR","country-code":"ES","event_details":"<p>Vamos a realizar plantación de especies tanto en los patios y recintos del colegio como en el campo de futbol adyacente. La plantación tendrá lugar el 29 de noviembre (si el clima lo permite)</p>","subscription_instructions":"<p></p>"}},{"id":8941,"name":"NATIONAL TREE PLANTING DAY","slug":"NATIONAL-TREE-PLANTING-DAY","tags":[61787,61807,300],"fields":{"lat":38.07909612417021,"date":"09-11-2024","long":23.722204474668477,"open":"Open Event","host-name":"We4all","event-name":"NATIONAL TREE PLANTING DAY","country-code":"GR","event_details":"<p>This was a great day where over 300 people gathered together to become friends and help nature. Children with their families, volunteer organizations and fire protection services joined in to plant. As a result 500 new trees got planted and watered, ready to keep on growing healthy under our supervision for the next 3 years.</p>","subscription_instructions":"<p>People can join us on this day. Post will be uploaded on our social media, instagram@we4all_official and our website www.we4all.com as well as they can contact us at info@we4all.com</p>"}},{"id":8946,"name":"there for trees - Planting with kids in Reichenbach","slug":"there-for-trees---Planting-with-kids-in-Reichenbach","tags":[61787,61807,756],"fields":{"lat":46.617150885411895,"date":"31-10-2024","long":7.670242148980676,"open":"Closed Event","host-name":"There for you","event-name":"there for trees - Planting with kids in Reichenbach","country-code":"CH","event_details":"<p>there for trees is collaborating with the local forestry team and students to create a climate-resilient, future-proof forest. Together with classes from Reichenbach, we will enhance the forest edge, planting a variety of species that promote biodiversity and strengthen the forest’s climate resilience. Over two days, a total of 500 shrubs and trees will be planted.</p>","subscription_instructions":"<p></p>"}},{"id":8948,"name":"ECOVARELA","slug":"ECOVARELA","tags":[61787,61807,724],"fields":{"lat":40.35082135755881,"date":"27-11-2024","long":-3.83546769797619,"open":"Open Event","host-name":"Ecoescuelas","event-name":"ECOVARELA","country-code":"ES","event_details":"<p>Realizar plantación de árboles autóctonos en el IES Luis Buñuel de Alcorcón, con la colaboración de la Concejalía de Parques y Jardines del Ayuntamiento.</p>","subscription_instructions":"<p>60</p>"}},{"id":8953,"name":"Miguel Servet plantamos árboles. ","slug":"Miguel-Servet-plantamos-arboles-","tags":[61787,61807,724],"fields":{"lat":38.48048304373628,"date":"23-11-2024","long":-0.8030879400669103,"open":"Closed Event","host-name":"Ecoescuelas","event-name":"Miguel Servet plantamos árboles. ","country-code":"ES","event_details":"<p>Un día de plantación con alumnado, profesorado y familias del centro. </p><p>Actividades anteriores inventario de los árboles del centro. </p>","subscription_instructions":"<p></p>"}},{"id":8955,"name":"España","slug":"Espana","tags":[61787,61807,724],"fields":{"lat":37.28763300280118,"date":"04-11-2024","long":-3.678206772950754,"open":"Closed Event","host-name":"Ecoescuelas","event-name":"España","country-code":"ES","event_details":"<p>Family bringing the trees, digging a hole and planting the tree.</p>","subscription_instructions":"<p></p>"}},{"id":8963,"name":"Bollebos plant bomen in Borgloon","slug":"Bollebos-plant-bomen-in-Borgloon","tags":[61787,61807,56],"fields":{"lat":50.79966137269699,"date":"24-11-2024","long":5.282353777921621,"open":"Open Event","host-name":"Bollebos VZW","event-name":"Bollebos plant bomen in Borgloon","country-code":"BE","event_details":"<p>Hallo! Wij zijn Mirte, Evi en Kristof, en samen dromen we van een groener Haspengouw. Help jij mee om onze droom werkelijkheid te maken?</p><p></p><p>Wat kun je verwachten op 24 november?</p><p></p><p>• Bomen planten: De bomen die we samen dankzij de crowdfunding mogelijk hebben gemaakt. Wij voorzien schoppen, maar je mag zeker ook je eigen materiaal meenemen. Denk aan een schop, laarzen, en voor de kinderen kan een emmertje en een klein schupje leuk zijn om mee te helpen!</p><p></p><p>• Eten en drinken: Bij de start om 10:00 uur kun je genieten van een croissant met koffie of water. ’s Middags voorzien we voor elke deelnemer twee broodjes met koffie of water.</p><p></p><p>• Geleide wandeling: Ontdek het natuurgebied met een gids die je alles vertelt over de unieke flora en fauna in Helshoven.</p><p></p><p>• Gezellige voorzieningen: Er is een tentje waar je even kunt uitrusten en samenkomen met andere deelnemers.</p><p></p><p>Datum: Zondag 24 november 2024</p><p></p><p>Locatie: Helshovenstraat, Borgloon</p><p></p><p>Tijd: 10:00 – 14:00 uur</p><p></p><p>Parkeren: Er is parkeergelegenheid langs de Helshovenstraat.</p><p></p><p>Kom samen met ons deze dag beleven en draag je steentje bij aan een groener Borgloon!</p>","subscription_instructions":"<p>Inschrijven via www.bollebos.be/borgloon</p>"}},{"id":8965,"name":"Reforestación del IES Europa","slug":"Reforestacion-del-IES-Europa","tags":[61786,61807,724],"fields":{"lat":37.48523016113381,"date":"12-12-2024","long":-1.613642533899455,"open":"Open Event","host-name":null,"event-name":"Reforestación del IES Europa","country-code":"ES","event_details":"<p>La organización del evento está aún en el aire ya que el jueves 14 de noviembre mantendremos una reunión el Comité Ambiental del IES Europa con el concejal de Medio Ambiente para organizar la reforestación. Se intentará realizarla en un enclave natural cercano a la localidad donde coinciden varias figuras de protección y se esta desarrollando un proyecto life para la recuperación del Águila Perdicera (Zona del Castillo de Chuecos). Queremos aprovechar la ocasión para dar a conocer los Espacios Naturales Protegidos cercanos y como pueden beneficiarnos.</p>","subscription_instructions":"<p>Dirigirse por correo electrónico a benjamin.manas@murciaeduca.es</p>"}},{"id":8979,"name":"Plantación E.E.I. El Tomillar","slug":"Plantacion-EEI-El-Tomillar","tags":[61787,61807,724],"fields":{"lat":40.57447055256064,"date":"29-11-2024","long":-3.9534895383751842,"open":"Closed Event","host-name":"Ecoescuelas","event-name":"Plantación E.E.I. El Tomillar","country-code":"ES","event_details":"<p>Tenemos pensado en hacer una pequeña fiesta con una batucada realizada por las familias de la escuela o banda musical, también realizada por las familias. También queríamos invitar a que participen las familias que puedan asistir y que disfruten de un evento bonito junto a sus pequeñ@s. Invitaremos a la Concejala de educación del Ayuntamiento y la representante del Ayuntamiento del Consejo Escolar. Así como la participación incondicional de tod@s los alumn@s del centro educativo, primer y segundo ciclo de Educación Infantil.</p>","subscription_instructions":"<p></p>"}},{"id":9001,"name":"CULTIVAMOS EL CAMBIO","slug":"CULTIVAMOS-EL-CAMBIO","tags":[61786,61807,724],"fields":{"lat":40.649250679284144,"date":"12-12-2024","long":-3.34089413459033,"open":"Closed Event","host-name":"Ecoescuelas","event-name":"CULTIVAMOS EL CAMBIO","country-code":"ES","event_details":"<p>Vamos a repoblar un terreno que tenemos en el centro, en el cual ya hay plantados unos árboles. Nuestra intención es formar un bosque ecosostenible con árboles autóctonos y con la implicación de toda la comunidad educativa.</p>","subscription_instructions":"<p></p>"}},{"id":9005,"name":"CULTIVAMOS EL CAMBIO","slug":"CULTIVAMOS-EL-CAMBIO","tags":[61787,61807,724],"fields":{"lat":40.649250679284144,"date":"28-11-2024","long":-3.34089413459033,"open":"Closed Event","host-name":"Ecoescuelas","event-name":"CULTIVAMOS EL CAMBIO","country-code":"ES","event_details":"<p>Queremos formar un bosque ecosostenible en un terreno de nuestro colegio con la ayuda de toda la comunidad educativa. </p>","subscription_instructions":"<p></p>"}},{"id":9011,"name":"Creating a Woven Hedge at Boerderij Hartstocht near Abcoude","slug":"Creating-a-Woven-Hedge-at-Boerderij-Hartstocht-near-Abcoude","tags":[61786,61807,528],"fields":{"lat":52.28104605521153,"date":"11-12-2024","long":5.00855898376194,"open":"Closed Event","host-name":"Stichting Life Terra","event-name":"Creating a Woven Hedge at Boerderij Hartstocht near Abcoude","country-code":"NL","event_details":"<p>Behind the Hartstocht farm in Abcoude, together with the Grond Verbond foundation, we are going to construct a woven hedge along the boundary path. Woven hedges have been around for a long time and were widely used as field fencing in the past. The hedges consist of small trees and shrubs, often with spines or thorns, woven together to provide a strong fence. We plant the different varieties in random order and after growing out for 5-6 years, the trees are braided and pruned, creating a natural hedge of between 1.5 and 2 meters high. At this farm, cows walking along on both sides of the hedge will do most of the pruning, making the hedge increasingly full and more attractive to insects and birds. A wicker hedge is an important addition to countryside biodiversity!</p>","subscription_instructions":"<p></p>"}},{"id":9017,"name":"PMO bridge planting","slug":"PMO-bridge-planting","tags":[61787,61807,440],"fields":{"lat":54.70289276719894,"date":"26-10-2024","long":25.36924092629654,"open":"Closed Event","host-name":"Myliu mišką","event-name":"PMO bridge planting","country-code":"LT","event_details":"<p>PMO bridge organizes events for project managers and instead of giving a goodie bag, they support NGO Myliu miska and in their name they plant a tree! So this saturday we had an honour to plant the trees!</p>","subscription_instructions":"<p></p>"}},{"id":9024,"name":"Planting Campaign in Bargfeld-Stegen","slug":"Planting-Campaign-in-Bargfeld-Stegen","tags":[61787,61807,276],"fields":{"lat":53.764085737064164,"date":"16-11-2024","long":10.152627226918547,"open":"Open Event","host-name":"Citizens Forests","event-name":"Planting Campaign in Bargfeld-Stegen","country-code":"DE","event_details":"<p>In a joint project with the Evangelische Stiftung Alsterdorf, we will plant the first part of a small, new forest at Gut Stegen. As always, we will be planting native trees using the Miyawaki method. </p><p></p><p>We’re seeking volunteers to help us dig!</p><p></p><p>Please note: The area is somewhat hidden and not easily accessible by public transport. Please park only in the designated parking area, as there are no spaces directly at the planting site.</p><p></p><p>We plan to complete the project over several planting campaigns, so</p><p>come be part of this green initiative and help us grow a vibrant, native forest! 🌳</p>","subscription_instructions":"<p>Fill out the registration form here: https://www.citizens-forests.org/buchung/ .Shortly before the planting event, we will send the details to everyone who has registered by email. </p>"}},{"id":9025,"name":"PLANTAMOS EN FAMILIA. E.I. ASERRÍN ASERRÁN","slug":"PLANTAMOS-EN-FAMILIA-EI-ASERRIN-ASERRAN","tags":[61787,61807,724],"fields":{"lat":40.50809660653766,"date":"06-11-2024","long":-3.893125311432283,"open":"Closed Event","host-name":"Ecoescuelas","event-name":"PLANTAMOS EN FAMILIA. E.I. ASERRÍN ASERRÁN","country-code":"ES","event_details":"<p>Se convocó a las familias de la escuela para realizar la plantación de árboles en el centro a través del correo electrónico y con cartelería. A las 16:00 h., tras recoger a sus hijos/as en las aulas, nos reunimos todos los participantes en el hall con el fin de repartir las tareas a realizar: cavar y hacer el agujero en las zonas elegidas en los patios, trasplantar los árboles, cubrir con tierra los cepellones, regar los árboles recién plantados.  Participaron un total de 34 familias. Al finalizar compartimos todos un vaso de leche con galletas.</p>","subscription_instructions":"<p></p>"}},{"id":9027,"name":"Planting Campaign in Obersdorf, Austria","slug":"Planting-Campaign-in-Obersdorf,-Austria","tags":[61787,61807,40],"fields":{"lat":48.38484067557121,"date":"16-11-2024","long":16.517495760031185,"open":"Open Event","host-name":null,"event-name":"Planting Campaign in Obersdorf, Austria","country-code":"AT","event_details":"<p>The Austrian association Citizens Forests Wolkersdorf is planting a mini-forest in Obersdorf (municipality of Wolkersdorf in the Weinviertel), near Vienna. Volunteers are needed here as well.</p><p></p><p>No registration is necessary. Please bring gloves, weatherproof clothing, and a spade (if you have one).</p><p></p><p>Meeting point: Boindlfeld, at the foot of the Tetzenberg.</p>","subscription_instructions":"<p>No registration necessary, meeting point: Boindlfeld at the foot of the Tetzenberg.</p>"}},{"id":9028,"name":"Planting Campaign in Hamburg-Wandsbek (Eichtalpark)","slug":"Planting-Campaign-in-Hamburg-Wandsbek-(Eichtalpark)","tags":[61787,61807,276],"fields":{"lat":53.57944111176822,"date":"23-11-2024","long":10.090902601027315,"open":"Open Event","host-name":"Citizens Forests","event-name":"Planting Campaign in Hamburg-Wandsbek (Eichtalpark)","country-code":"DE","event_details":"<p>As part of the transformation of Eichtalpark into a climate park in Wandsbek, we will be planting a bend extension on November 23, 2024, together with the Wandsbek District Office and the Superurban Project Office. We will be planting both native species and, at the district office’s request, some exotic tree and shrub species using the Miyawaki method.</p><p></p><p>Volunteer helpers can register on our website. We look forward to seeing you!</p>","subscription_instructions":"<p>Complete registration with this link or go to website: https://www.citizens-forests.org/buchung/</p>"}},{"id":9033,"name":"\"Plantando en la Locomotora\"","slug":"\"Plantando-en-la-Locomotora\"","tags":[61787,61807,724],"fields":{"lat":40.55994821010734,"date":"29-11-2024","long":-3.6271680583147403,"open":"Closed Event","host-name":"Ecoescuelas","event-name":"\"Plantando en la Locomotora\"","country-code":"ES","event_details":"<p>El evento lo llevaremos a cabo dentro de nuestro centro en dos fases. La primera de ellas serán de propuestas de motivación: </p><p>- Cuentacuentos y propuesta lúdica.</p><p>- Creación de tarjetas la plantación.</p><p>- Plantación (propiamente dicha)</p>","subscription_instructions":"<p></p>"}},{"id":9035,"name":"Kikkoman Tree Planting Campaign Kickoff","slug":"Kikkoman-Tree-Planting-Campaign-Kickoff","tags":[61787,61807,276],"fields":{"lat":50.99089647354775,"date":"20-11-2024","long":7.442859342561894,"open":"Closed Event","host-name":"Stichting Life Terra","event-name":"Kikkoman Tree Planting Campaign Kickoff","country-code":"DE","event_details":"<p>🌱 Exciting day planting with Kikkoman for the first time! Today, the amazing team from Kikkoman Trading Europe joined us in Engelskirchen to kick off our collaboration. 🌍✨</p><p></p><p>They support us in planting 50,000 trees by 2030, and it was fantastic to see their management and marketing team actively participate in such a great cause! 🙌💚</p><p></p><p>Here’s to many more green adventures ahead! 🌳💪</p>","subscription_instructions":"<p></p>"}},{"id":9037,"name":"Casvi Boadilla","slug":"Casvi-Boadilla","tags":[61787,61807,724],"fields":{"lat":40.42145362264652,"date":"27-11-2024","long":-3.8988738935875005,"open":"Closed Event","host-name":"Ecoescuelas","event-name":"Casvi Boadilla","country-code":"ES","event_details":"<p>En una inspiradora jornada de acción climática, los alumnos de 6º de Primaria del Colegio Casvi Boadilla participaron activamente en el European Tree Planting Day. Como parte de los preparativos, los estudiantes aprendieron a identificar especies nativas adecuadas para el terreno de su escuela y sus alrededores. Utilizando aplicaciones como Pl@ntNet y consultando herramientas digitales como ARCGIS, seleccionaron cuidadosamente árboles adaptados al clima local evitando especies invasoras y considerando aquellas en peligro de extinción.</p><p>La actividad comenzó con dinámicas grupales que motivaron a los alumnos a reflexionar sobre  el cambio climático y cómo sus acciones pueden contribuir al cuidado del medio ambiente. Tras la explicación teórica y demostración práctica realizada por los docentes, los estudiantes se dividieron en grupos pequeños para llevar a cabo la plantación. Equipados con palas y azadones, plantaron cuidadosamente los árboles (castaño, nogal, granado y níspero) siguiendo las instrucciones para asegurar su correcto crecimiento.</p><p>Para garantizar el seguimiento de los árboles plantados, cada ejemplar fue etiquetado utilizando la plataforma Life Terra. Los estudiantes registraron datos sobre las especies y ubicaciones mediante smartphones, integrándolos en el mapa global de Life Terra. </p>","subscription_instructions":"<p></p>"}},{"id":9039,"name":"Marina Alta - Primer voluntariado 2024","slug":"Marina-Alta---Primer-voluntariado-2024","tags":[61787,61807,724],"fields":{"lat":38.833163862188776,"date":"30-11-2024","long":-0.14983238656425893,"open":"Open Event","host-name":"Desert leaves","event-name":"Marina Alta - Primer voluntariado 2024","country-code":"ES","event_details":"<p>We managed to gather a very enthusiastic group of volunteers from several organisations, such as Pego Viu, Musica Pel Clima, Tornem Cultura i Sostenibilitat and of course Desert Leaves.  The weather was ideal for the planting, and we managed to put a few hundred trees in the ground.  After the event, Pego Viu treated us with drinks and empanadas, with musical entertainement organized by Elio, Guille, Verònica.</p>","subscription_instructions":"<p>Join us on this tree planting event, open to everyone, in Pego, Alicante.  Find more information and register at https://www.eventbrite.es/e/entradas-dia-de-plantar-arboles-1er-voluntariado-2024-1069052758579?aff=oddtdtcreator</p>"}},{"id":9043,"name":"Desert Leaves - 2nd planting event in Pego","slug":"Desert-Leaves---2nd-planting-event-in-Pego","tags":[61786,61807,724],"fields":{"lat":38.83649926031296,"date":"15-12-2024","long":-0.14169026557911196,"open":"Open Event","host-name":"Pego Viu","event-name":"Desert Leaves - 2nd planting event in Pego","country-code":"ES","event_details":"<p>Join us in the second volunteering of the year 2024 to plant trees in Pego! It will be a day full of nature, fellowship and good vibes. No previous experience is required, just a desire to help the environment and have a good time outdoors. Don't miss it!</p>","subscription_instructions":"<p>All information and the registration form is available at https://www.eventbrite.es/e/entradas-dia-de-plantar-arboles-2o-voluntariado-2024-1082368365919?aff=oddtdtcreator</p>"}},{"id":9045,"name":"NaturalizArte","slug":"NaturalizArte","tags":[61786,61807,724],"fields":{"lat":40.5675646130202,"date":"13-12-2024","long":-3.924682457439772,"open":"Closed Event","host-name":"Ecoescuelas","event-name":"NaturalizArte","country-code":"ES","event_details":"<p>La actividad consistirá en plantar tres árboles (laurel, alcornoque y madroño) en un espacio del patio para iniciar su naturalización.</p>","subscription_instructions":"<p></p>"}},{"id":9046,"name":"Planting in The Green Rebel Farm with College Hageveld","slug":"Planting-in-The-Green-Rebel-Farm-with-College-Hageveld","tags":[61787,61807,724],"fields":{"lat":41.05198755617255,"date":"24-10-2024","long":0.5372134630934128,"open":"Closed Event","host-name":"Stichting Life Terra","event-name":"Planting in The Green Rebel Farm with College Hageveld","country-code":"ES","event_details":"<p>The planting activity at The Green Rebel farm in Miravet was an inspiring and hands-on experience for everyone involved. Over the five-day event, 24 students from College Hageveld, accompanied by three teachers, planted 200 trees in Hageveld’s Foodforest, continuing their tradition of planting one tree for each graduating student. The students worked enthusiastically, learning about regenerative agroforestry practices while preparing the soil with biochar, sowing fava beans, and adding mulch and cover crops to ensure the trees thrive in the challenging Mediterranean conditions.</p><p></p><p>The atmosphere was vibrant, with students enjoying the process of planting and gaining a deeper understanding of how these actions contribute to combating climate change. The weather was cooperative, with sunny days making the work enjoyable. In addition to planting, the group bonded over shared meals they prepared with fresh produce harvested from the farm, creating a strong connection to the land and to each other. This event not only added 200 more trees to the food forest but also planted seeds of awareness and hope in the minds of young people, empowering them to take action for a sustainable future.</p>","subscription_instructions":"<p></p>"}},{"id":9063,"name":"Recuperar arbolado en las zonas comunes del CEIP MOZART ","slug":"Recuperar-arbolado-en-las-zonas-comunes-del-CEIP-MOZART-","tags":[61787,61807,724],"fields":{"lat":40.49863834853185,"date":"29-11-2024","long":-3.374279158146338,"open":"Closed Event","host-name":null,"event-name":"Recuperar arbolado en las zonas comunes del CEIP MOZART ","country-code":"ES","event_details":"<p>Colabora con nosotros CIEMAT. Han conseguido que vivero ARBA nos donen los plantones. Nos van ayudar en la plantación y a colaborar con nosotros. </p><p>Proceso:</p><p>1. Los alumnos de 4º, 5º y 6º de Primaria van a relazar la actividad de plantado.</p><p>2. Haremos el agujero.</p><p>3. Prepararemos la tierra. Mezclamos arena de rio, humus de lombriz y la tierra extraída.</p><p>4. Sacaremos el plantón de la maceta.</p><p>5. Plantaremos y rellenamos de tierra.</p><p>6. Etiquetamos a través de un placa identificativa la planta.</p>","subscription_instructions":"<p></p>"}},{"id":9064,"name":"Adyen Paris restoration planting in Châteaupers","slug":"Adyen-Paris-restoration-planting-in-Chateaupers","tags":[61787,61807,250],"fields":{"lat":48.538154667188046,"date":"29-11-2024","long":2.0389433223444815,"open":"Closed Event","host-name":"Stichting Life Terra","event-name":"Adyen Paris restoration planting in Châteaupers","country-code":"FR","event_details":"<p>During this morning event, the Adyen employees of the Paris department will come to the spot and help Life Terra plant some of the trees that will reconnect the main forest, to isolated patches of wood scattered in the agricultural fields around Chateaupers.  This will boost biodiversity and ecological restoration.</p>","subscription_instructions":"<p></p>"}},{"id":9065,"name":"BVMW Pflanzung mit Life Terra","slug":"BVMW-Pflanzung-mit-Life-Terra","tags":[61787,61807,276],"fields":{"lat":50.99089647354775,"date":"20-11-2024","long":7.442859342561894,"open":"Closed Event","host-name":"Stichting Life Terra","event-name":"BVMW Pflanzung mit Life Terra","country-code":"DE","event_details":"<p>What a fantastic day with Life Terra’s Germany team and members of BVMW Rheinisch-Bergischer-Kreis & Rhein-Sieg-Kreis/Ost, Wirtschaftsregion Südliches NRW (German Association of Small and Medium-Sized Businesses)</p><p>Despite the snow, we came together to plant our first 50 trees, with many more to come!</p><p>It was also a great opportunity to connect with the directors of REIMAGINE 2050, who joined us in this meaningful effort.</p><p>We’re excited to see more companies getting involved in climate action and taking steps to create a better world!</p>","subscription_instructions":"<p></p>"}},{"id":9067,"name":"CEIP CIUDAD DE NARA","slug":"CEIP-CIUDAD-DE-NARA","tags":[61787,61807,724],"fields":{"lat":39.87875839657332,"date":"31-10-2024","long":-4.029381286308027,"open":"Closed Event","host-name":"Ecoescuelas","event-name":"CEIP CIUDAD DE NARA","country-code":"ES","event_details":"<p>El colegio CEIP Ciudad de Nara (Toledo) ha valorado los espacios del centro y ha detectado la necesidad de plantar dos árboles que diesen sobra en una zona próxima al polideportivo. Se plantará dos moreras que son de rápido crecimiento y proporcionan mucha sombra. </p><p></p><p>Se han detectado también dos espacios en el paseo principal de acceso al Centro con dos árboles secos que serán sustituidos por un tilo y un almez.</p>","subscription_instructions":"<p></p>"}},{"id":9074,"name":"Networking event at Boerderij Hartstocht Abcoude","slug":"Networking-event-at-Boerderij-Hartstocht-Abcoude","tags":[61786,61807,528],"fields":{"lat":52.28104605521153,"date":"13-12-2024","long":5.00855898376194,"open":"Closed Event","host-name":"Stichting Life Terra","event-name":"Networking event at Boerderij Hartstocht Abcoude","country-code":"NL","event_details":"<p>Behind the Hartstocht farm in Abcoude, together with the Grond Verbond foundation, we are going to construct a woven hedge along the boundary path. Woven hedges have been around for a long time and were widely used as field fencing in the past. The hedges consist of small trees and shrubs, often with spines or thorns, woven together to provide a strong fence. We plant the different varieties in random order and after growing out for 5-6 years, the trees are braided and pruned, creating a natural hedge of between 1.5 and 2 meters high. At this farm, cows walking along on both sides of the hedge will do most of the pruning, making the hedge increasingly full and more attractive to insects and birds. A wicker hedge is an important addition to countryside biodiversity!</p><p></p><p>During this event we have invited multiple of our partners. This will not only give them the opportunity to connect with nature, but also connect to other organisations and people in their sector.</p>","subscription_instructions":"<p></p>"}},{"id":9079,"name":"LOS OLIVOS","slug":"LOS-OLIVOS","tags":[61787,61807,724],"fields":{"lat":40.62472970327693,"date":"26-11-2024","long":-3.239238471187892,"open":"Closed Event","host-name":"Ecoescuelas","event-name":"LOS OLIVOS","country-code":"ES","event_details":"<p>The students of the center together with the teachers have planted the trees in the Nature Area of ​​our school.</p>","subscription_instructions":"<p></p>"}},{"id":9091,"name":"Compensar CO2 de las Fallas","slug":"Compensar-CO2-de-las-Fallas","tags":[61787,61807,724],"fields":{"lat":39.130748454338566,"date":"24-11-2024","long":-0.39122957409713516,"open":"Open Event","host-name":"Interpreta Natura","event-name":"Compensar CO2 de las Fallas","country-code":"ES","event_details":"<p>Esta jornada servirá para dar a conocer los proyectos innovadores que están llevándose a cabo en la ciudad. Para ello se desarrollarán una serie de charlas, actividades medioambientales dirigidas al público infantil, un gran almuerzo y la plantación de 120 árboles. </p><p>Se redactará un artículo que será publicado en el libreto de la falla. </p><p></p><p>Esta acción será conducida por 3 técnicos especialistas. Se propone la siguiente estructura de actividad:</p><p>10:00. Recepción y bienvenida al terreno. </p><p>10:15. Presentación de la entidad y el proyecto. </p><p>10:30. Visita al terreno con explicación de los proyectos y taller infantil simultáneo. </p><p>11:30. Almuerzo</p><p>12:00. Plantación y taller infantil simultáneo. </p><p>13:30. Cierre y despedida</p>","subscription_instructions":"<p>El evento es libre y abierto a la ciudadanía. Para poder participar deberán de asistir el día 24 de noviembre a partir de las 10am. en el terreno \"Forest Lab\" https://maps.app.goo.gl/pAa4oTa6uGJvq66W8 </p>"}},{"id":9093,"name":"Planting with Huawei at Lingehout","slug":"Planting-with-Huawei-at-Lingehout","tags":[61786,61807,528],"fields":{"lat":51.876210541784026,"date":"10-12-2024","long":5.334060141981185,"open":"Closed Event","host-name":"Stichting Life Terra","event-name":"Planting with Huawei at Lingehout","country-code":"NL","event_details":"<p>During this event with Huawei we will implement the last stage of the agroforesty project at Lingehout. The trees planted will generate a food forest which will be able to provide food for the next coming years.</p>","subscription_instructions":"<p></p>"}},{"id":9098,"name":"Plantación del CEIP SAN JOSÉ (Torrejón de la Calzada)","slug":"Plantacion-del-CEIP-SAN-JOSE-(Torrejon-de-la-Calzada)","tags":[61786,61807,724],"fields":{"lat":40.19843198997195,"date":"13-12-2024","long":-3.806019428230234,"open":"Closed Event","host-name":"Ecoescuelas","event-name":"Plantación del CEIP SAN JOSÉ (Torrejón de la Calzada)","country-code":"ES","event_details":"<p>Plantación forestal en el patio del colegio y en un terreno municipal.</p>","subscription_instructions":"<p></p>"}},{"id":9100,"name":"CEIP ELOY SAAVEDRA CIEMPOZUELOS","slug":"CEIP-ELOY-SAAVEDRA-CIEMPOZUELOS","tags":[61787,61807,724],"fields":{"lat":40.15353563340033,"date":"17-10-2024","long":-3.6263303797407787,"open":"Open Event","host-name":"Ecoescuelas","event-name":"CEIP ELOY SAAVEDRA CIEMPOZUELOS","country-code":"ES","event_details":"<p>Plantación de arándanos en una de las zonas colindantes al Huerto escolar de Infantil.</p><p>Cada grupo participante se encargó de un par de ejemplares, con distintas funciones: Preparación del terreno, plantación, y riego.</p>","subscription_instructions":"<p>DOCENTES Y ALUMNOS</p>"}},{"id":9104,"name":"Bosque Calasanz ","slug":"Bosque-Calasanz-","tags":[61787,61807,724],"fields":{"lat":40.261976222063225,"date":"24-11-2024","long":-3.697457216725579,"open":"Open Event","host-name":"Ecoescuelas","event-name":"Bosque Calasanz ","country-code":"ES","event_details":"<p>The principal goals was completed.</p><p>We planted 71 trees of 5 different species in an urban area placed in the north of our Village.</p><p>Several families of our school participate with pupils of different ages in a sunny and warm day.</p><p></p><p></p>","subscription_instructions":"<p>To a registraron form and with a free assistance</p>"}},{"id":9106,"name":"CEIP SAN BLAS","slug":"CEIP-SAN-BLAS","tags":[61787,61807,724],"fields":{"lat":40.636980938952235,"date":"26-11-2024","long":-3.2415580173340746,"open":"Closed Event","host-name":null,"event-name":"CEIP SAN BLAS","country-code":"ES","event_details":"<p>Un operario del Ayuntamiento de Cabanillas del Campo se encargó a primera hora de la mañana de dejar preparados los agujeros en el lugar seleccionado para la plantación. A lo largo de la mañana fueron pasando las diferentes clases plantando los arbustos. Cada nivel educativo ha apadrinado un durillo y se va a encargar de su cuidado y seguimiento. Durante la plantación hubo representación tanto del Ayuntamiento como del sector de las familias del Comité Ambiental del Centro. Las niñas y los niños disfrutaron con la actividad y demostraron su interés y compromiso con el cuidado del medio ambiente.</p>","subscription_instructions":"<p></p>"}},{"id":9107,"name":"Colegio Quercus","slug":"Colegio-Quercus","tags":[61787,61807,724],"fields":{"lat":40.40497128331889,"date":"03-12-2024","long":-3.90381660740282,"open":"Closed Event","host-name":"Ecoescuelas","event-name":"Colegio Quercus","country-code":"ES","event_details":"<p>La actividad de plantación fue un éxito.</p><p>Los niños disfrutaron y aprendieron de la mano del técnico del aula medioambiental de Boadilla, el cual les guió paso a paso en este proceso. Todos participaron y se comprometieron a hacer un seguimiento de nuestra encina, especie que da nombre a nuestro colegio 😊</p>","subscription_instructions":"<p></p>"}},{"id":9109,"name":"ESCUELA INFANTIL EL TOMILLAR","slug":"ESCUELA-INFANTIL-EL-TOMILLAR","tags":[61787,61807,724],"fields":{"lat":40.57447055256064,"date":"29-11-2024","long":-3.9534895383751842,"open":"Open Event","host-name":"Ecoescuelas","event-name":"ESCUELA INFANTIL EL TOMILLAR","country-code":"ES","event_details":"<p>UN PEQUEÑO RITUAL DE PLANTACIÓN, DONDE ESTÁ INVITADA TODA LA COMUNIDAD EDUCATIVA.</p>","subscription_instructions":"<p>ACUDIENDO EL DIA DE LA PLANTACIÓN A LA ESCUELA</p>"}},{"id":9113,"name":"Transformando espacios  transformando mentes en Barcience","slug":"Transformando-espacios--transformando-mentes-en-Barcience","tags":[61787,61807,724],"fields":{"lat":39.98091123533722,"date":"27-11-2024","long":-4.238812013336926,"open":"Closed Event","host-name":"Ecoescuelas","event-name":"Transformando espacios  transformando mentes en Barcience","country-code":"ES","event_details":"<p>Gracias a la asociación de Torrijos, llamada Proyecto Germen por la donación de plantas y cesión del material para la ejecución de la plantación, a Ecoescuelas y a los consejos de LifeTerra, nos hemos iniciado en esta propuesta tan solidaria por el planeta.</p><p>En este caso las clases de infantil y primero de primaria, tuvieron la suerte de preparar todo para plantar esta planta en la zona destinada a ello.</p>","subscription_instructions":"<p></p>"}},{"id":9114,"name":"Lab Aberto 2024","slug":"Lab-Aberto-2024","tags":[61787,61807,620],"fields":{"lat":39.15645460396882,"date":"30-11-2024","long":-9.218701886329123,"open":"Closed Event","host-name":"Associação Naturaleza y Hombre Portugal","event-name":"Lab Aberto 2024","country-code":"PT","event_details":"<p>“Lab Aberto fosters creativity and technological innovation in schools by establishing specialized laboratories. In these spaces, students build flying wings, autonomous cars and boats, and create objects using 3D printers with a variety of materials. Lab Aberto prepares students for the technological challenges of the future by engaging them in the artificial universe. However, Lab Aberto and its partner, Life Terra, believe that this admirable artificial world of the future will be even better when it is synergistically aligned with human nature and ecological sustainability.</p><p></p><p>On November 30th, the event began in the laboratory, with its coordinator, António Gonçalves, explaining the initiative and its objectives. Following this, 25 volunteers sowed cork oak acorns into small ceramic pots produced with a 3D printer. These seedlings will grow into saplings to be planted next year. Clara Araújo, representing ALTRI Florestal, and Renato Ferreira from the Municipality of Torres Vedras explained the entire process.</p><p></p><p>After the sowing activity, we moved to the field to plant strawberry trees. Lab Aberto aims to work increasingly at the intersection of forestry and technology. ALTRI, the Municipality of Torres Vedras, and Life Terra will continue to collaborate with Lab Aberto, and in a year, our cork oak saplings will be ready for planting.”</p><p></p><p></p>","subscription_instructions":"<p></p>"}},{"id":9131,"name":"Nationale Boomfeestdag","slug":"Nationale-Boomfeestdag","tags":[61787,61807,528],"fields":{"lat":52.71212827103077,"date":"20-11-2024","long":6.4072415064984725,"open":"Closed Event","host-name":"Boomfeestdag","event-name":"Nationale Boomfeestdag","country-code":"NL","event_details":"<p>Echten - With a push of the green button, Albert Verlinde (chairman of the National Tree Planting Day Foundation), Inge Nieuwenhuizen (mayor of the municipality of De Wolden) and Sylvo Thijsen (director of Staatsbosbeheer) opened the 67th National Tree Planting Day today at Staatsbosbeheer-forest ranger's office Ruinen in Echten . During this green holiday, thousands of pupils throughout the Netherlands left their classrooms and went into their residential areas or nature to plant trees.</p><p> </p><p></p><p>Donné Slangen, Director-General of Nature and Fisheries of the Ministry of Agriculture, Fisheries, Food Security and Nature confirmed later that day the importance of nature education for all children. Together with a number of children, he planted a tree in the Ruinen forestry in the municipality of De Wolden (Drenthe). In doing so, he and all the other planters became, according to columnist Marcel van Ool, advisor on landscape and cultural history of Staatsbosbeheer, 'part of a miracle'.</p>","subscription_instructions":"<p></p>"}},{"id":9146,"name":"PLANTACIÓN E.I SANSERITO OTOÑO 2024","slug":"PLANTACION-EI-SANSERITO-OTONO-2024","tags":[61786,61807,724],"fields":{"lat":40.56088834975125,"date":"11-12-2024","long":-3.622856309461813,"open":"Closed Event","host-name":"Ecoescuelas","event-name":"PLANTACIÓN E.I SANSERITO OTOÑO 2024","country-code":"ES","event_details":"<p>Para la realización de esta actividad, contamos con una serie de familiares interesados en ayudarnos con la plantación. Ellos y ellas serán los encargados de realizar las tareas necesarias para la plantación de uno o varios árboles y en función del clima, saldremos con los niños a verlo. Después, transmitiremos lo que se ha hecho al resto de familias.</p>","subscription_instructions":"<p></p>"}},{"id":9158,"name":"Transformando espacios  transformando mentes en Barcience ","slug":"Transformando-espacios--transformando-mentes-en-Barcience-","tags":[61787,61807,724],"fields":{"lat":39.98085227113979,"date":"27-11-2024","long":-4.238625192449359,"open":"Closed Event","host-name":"Ecoescuelas","event-name":"Transformando espacios  transformando mentes en Barcience ","country-code":"ES","event_details":"<p>Gracias a la asociación de Torrijos, llamada Proyecto Germen por la donación de plantas y cesión del material para la ejecución de la plantación, a Ecoescuelas y a los consejos de LifeTerra, nos hemos iniciado en esta propuesta tan solidaria por el planeta.</p><p>En este caso las clase de infantil y primero de primaria, tuvieron la suerte de preparar todo para plantar el Laure en la zona destinada a ello</p>","subscription_instructions":"<p></p>"}},{"id":9159,"name":"Transformando espacios  transformando mentes en Barcience","slug":"Transformando-espacios--transformando-mentes-en-Barcience","tags":[61787,61807,724],"fields":{"lat":39.98085227113979,"date":"27-11-2024","long":-4.238625192449359,"open":"Open Event","host-name":"Ecoescuelas","event-name":"Transformando espacios  transformando mentes en Barcience","country-code":"ES","event_details":"<p>Gracias a la asociación de Torrijos, llamada Proyecto Germen por la donación de plantas y cesión del material para la ejecución de la plantación, a Ecoescuelas y a los consejos de LifeTerra, nos hemos iniciado en esta propuesta tan solidaria por el planeta.</p><p>En este caso la clase de Tercero, tuvo la suerte de preparar todo para plantar el Laure en la zona destinada a ello</p>","subscription_instructions":"<p>Los profes de science vamos a invitar a participara a nuestro alumnado</p>"}},{"id":9167,"name":"Plantando con cuarto de primaria en el CEIP JUAN DE AUSTRIA","slug":"Plantando-con-cuarto-de-primaria-en-el-CEIP-JUAN-DE-AUSTRIA","tags":[61787,61807,724],"fields":{"lat":40.331022900446314,"date":"04-12-2024","long":-3.7655059285682233,"open":"Closed Event","host-name":"Ecoescuelas","event-name":"Plantando con cuarto de primaria en el CEIP JUAN DE AUSTRIA","country-code":"ES","event_details":"<p>He tenido problemas para registrar los dos árboles,  adjunto la imagen del problema que me da, ya que teniendo activada la localización me dice que no, y lo he intentado con android y peor... se queda en blanco.</p><p>La plantación fue genial! cuarto A plantó un cerezo en el huerto y cuarto B plantó el manzano en otra zona de3ntro del patio del colegio. Participaron todos los alumnos y fue una actividad muy enriquecedora.</p>","subscription_instructions":"<p></p>"}},{"id":9168,"name":"CEIP EL QUIÑON reforestamos","slug":"CEIP-EL-QUINON-reforestamos","tags":[61786,61807,724],"fields":{"lat":40.13694494802694,"date":"16-12-2024","long":-3.6670308526607096,"open":"Closed Event","host-name":"Ecoescuelas","event-name":"CEIP EL QUIÑON reforestamos","country-code":"ES","event_details":"<p></p>","subscription_instructions":"<p></p>"}},{"id":9175,"name":"St Ciaran's NS","slug":"St-Ciaran's-NS","tags":[61787,61807,372],"fields":{"lat":53.393394644243514,"date":"06-12-2024","long":-6.421469928295537,"open":"Open Event","host-name":"Stepping Stone Forests","event-name":"St Ciaran's NS","country-code":"IE","event_details":"<p>Every child in the school got an opprtunity to participate in this planting event to some extent. They were joined by teachers, special needs assistants, parents, community volunteers, and volunterrs from Stepping Stone Forest sponsors #AWSiNCommunities. The weather was kind to us although conditions were muddy as might be expected. The event was an outstanding success.</p>","subscription_instructions":"<p>https://steppingstoneforests.org/events/</p>"}},{"id":9178,"name":"\"Raíces por el Planeta\" O \"Roots for the Planet\". ","slug":"\"Raices-por-el-Planeta\"-O-\"Roots-for-the-Planet\"-","tags":[61787,61807,724],"fields":{"lat":39.46278389226502,"date":"02-12-2024","long":-3.529029610619358,"open":"Closed Event","host-name":"Ecoescuelas","event-name":"\"Raíces por el Planeta\" O \"Roots for the Planet\". ","country-code":"ES","event_details":"<p>En conmemoración del Día de la Ecología (1 de diciembre), los alumnos del grupo de TVA-Capacitación del CPEE Mingoliva de Madridejos (Toledo), en la asignatura de Operaciones Agrarias,  llevarán a cabo una actividad ecológica. Como parte de su aprendizaje práctico, participarán en la plantación de dos almendros en las zonas ajardinadas del centro, con el objetivo de promover la conciencia ecológica y destacar la importancia de los árboles en el entorno educativo.</p><p></p><p>In commemoration of Ecology Day (December 1), the students of the TVA-Training group at the CPEE Mingoliva in Madridejos (Toledo), in the subject of Agricultural Operations, will carry out an ecological activity. As part of their practical learning, they will participate in planting two almond trees in the landscaped areas of the center, with the aim of promoting ecological awareness and highlighting the importance of trees in the educational environment.</p>","subscription_instructions":"<p></p>"}},{"id":9192,"name":"Planting with the kids from the \"Ecole Josquin des Près\"","slug":"Planting-with-the-kids-from-the-\"Ecole-Josquin-des-Pres\"","tags":[61787,61807,250],"fields":{"lat":48.538154667188046,"date":"29-11-2024","long":2.0389433223444815,"open":"Closed Event","host-name":"Stichting Life Terra","event-name":"Planting with the kids from the \"Ecole Josquin des Près\"","country-code":"FR","event_details":"<p>The kids from the local school, \"Ecole Josquin des Près,\" will come to the Châteaupers farm to contribute to planting trees that will restore the biodiversity that was degraded by the last decades of monoculture.</p>","subscription_instructions":"<p></p>"}},{"id":9201,"name":"Plantar árboles en el colegio CIPE Sierra de Guadarrama","slug":"Plantar-arboles-en-el-colegio-CIPE-Sierra-de-Guadarrama","tags":[61786,61807,724],"fields":{"lat":40.66742012357458,"date":"12-12-2024","long":-4.089375684760634,"open":"Closed Event","host-name":"Ecoescuelas","event-name":"Plantar árboles en el colegio CIPE Sierra de Guadarrama","country-code":"ES","event_details":"<p>Se estima que la semana del 9 al 13 se realice la plantación de especies arbóreas y arbustivas autóctonas cedidas por el IES de Capacitación Agraria de Villaviciosa de Odón. </p><p></p><p>En esta actividad participará todo el colegio, con la colaboración de padres y madres del alumnado.</p>","subscription_instructions":"<p></p>"}},{"id":9203,"name":"Plantación con Saeta Yield en Las Rozas","slug":"Plantacion-con-Saeta-Yield-en-Las-Rozas","tags":[61786,61807,724],"fields":{"lat":40.50441833539093,"date":"11-12-2024","long":-3.8831086043634695,"open":"Closed Event","host-name":"Stichting Life Terra","event-name":"Plantación con Saeta Yield en Las Rozas","country-code":"ES","event_details":"<p>El esfuerzo de restaurar zonas degradadas no es tarea fácil. Este año, una de las zonas designadas para restauración ecológica ha sido la Dehesa de Navalcarbón, en la localidad madrileña de Las Rozas.</p><p></p><p>Durante este otoño de 2024 se están realizando varias plantaciones con voluntarios en la zona para aumentar los valores de biodiversidad y la resiliencia del entorno ¡El miércoles 11 de diciembre es el turno de los empleados y las empleadas de Saeta Yield! No es la primera vez que plantamos juntos, y estamos seguros de que harán una gran labor plantando 100 árboles y arbustos de 7 especies diferentes.</p>","subscription_instructions":"<p></p>"}},{"id":9205,"name":"Planting in Lekenik","slug":"Planting-in-Lekenik","tags":[61787,61807,191],"fields":{"lat":45.592652139355145,"date":"26-11-2024","long":16.204643285731613,"open":"Closed Event","host-name":"Co2mpensating by planting","event-name":"Planting in Lekenik","country-code":"HR","event_details":"<p>The 104th reforestation campaign in Lekenik, Croatia, is a collaborative effort involving volunteers from Generali Hrvatska, students, and teachers from local schools (including IX. Gimnazija Zagreb, the Islamic Gymnasium, and the Zagreb Woodworking School), and organisers from the Croatian Scouts Association, Hrvatske šume doo, and Hearth agency.</p>","subscription_instructions":"<p></p>"}},{"id":9207,"name":"101st reforestation campaign in Brezovica Forest","slug":"101st-reforestation-campaign-in-Brezovica-Forest","tags":[61787,61807,191],"fields":{"lat":45.48689889909232,"date":"20-11-2024","long":16.365075261226526,"open":"Closed Event","host-name":"Co2mpensating by planting","event-name":"101st reforestation campaign in Brezovica Forest","country-code":"HR","event_details":"<p>101st reforestation campaign in Brezovica Forest, organised in partnership with Raiffeisen Bank and our incredible collaborators: the Croatian Scouts Association, Hearth agency, and Hrvatske šume doo. 🌱\\</p><p></p><p>This event highlights the power of collective action to achieve a shared vision—a greener planet for future generations. Participants will plant trees to help restore the forest and enhance local biodiversity while creating a lasting environmental impact.</p>","subscription_instructions":"<p></p>"}},{"id":9212,"name":"Ampliación  arbolado IES CLARA CAMPOAMOR YUNQUERA CLM","slug":"Ampliacion--arbolado-IES-CLARA-CAMPOAMOR-YUNQUERA-CLM","tags":[61787,61807,724],"fields":{"lat":40.75146635581386,"date":"04-12-2024","long":-3.168274663687849,"open":"Closed Event","host-name":"Ecoescuelas","event-name":"Ampliación  arbolado IES CLARA CAMPOAMOR YUNQUERA CLM","country-code":"ES","event_details":"<p>Los alumnos de nuestra FP Básica de Agrojardinería y Composiciones Florales y los ecodelegados de 1º de ESO llevarán a cabo esta bonita actividad. En primer lugar, Todos los alumnos elegirán las especies a plantar del invernadero que ya tenemos dispuesto en nuestras instalaciones. En segundo lugar, los alumnos de la FP Básica, realizarán los hoyos para la plantación. A continuación, todos los alumnos y en especial los ecodelegados de 1º de ESO llevarán a cabo la plantación de las especies elegidas anteriormente. En los días posteriores a la plantación, se irá a regar las especies plantadas conforme al calendario de su crecimiento.</p>","subscription_instructions":"<p></p>"}},{"id":9215,"name":"Tree Nursery Launching","slug":"Tree-Nursery-Launching","tags":[61787,61807,724],"fields":{"lat":36.322164096546906,"date":"29-11-2024","long":-5.291450525547981,"open":"Closed Event","host-name":"Ecoescuelas","event-name":"Tree Nursery Launching","country-code":"ES","event_details":"<p>Launching event of the school tree nursery. Children from Early years to Middle school have been assigned a local tree or bush species to learn about in class and they will plant clippings or seeds in pots they have previously decorated. They will take care of their pot throughout the year and learn more about their class species.   </p>","subscription_instructions":"<p></p>"}},{"id":9228,"name":"Planting in Trogir","slug":"Planting-in-Trogir","tags":[61787,61807,191],"fields":{"lat":43.543058585434125,"date":"26-10-2024","long":16.27711636951063,"open":"Open Event","host-name":"Boranka","event-name":"Planting in Trogir","country-code":"HR","event_details":"<p>Join us this Saturday for our next Boranka reforestation campaign in the beautiful Plano neighborhood of Trogir. Volunteers will come together to plant native trees, contributing to the restoration of local forests and the fight against climate change.</p><p></p><p>This action marks part of Boranka's longstanding commitment to reforestation, with previous campaigns already involving thousands of volunteers planting over 140,000 trees in Croatia. All tools and guidance will be provided, and participants will have the chance to make a lasting impact on the environment while enjoying a rewarding day outdoors.</p>","subscription_instructions":"<p>Sign up on website.</p>"}},{"id":9234,"name":"Uma árvore para o futuro ","slug":"Uma-arvore-para-o-futuro-","tags":[61786,61807,620],"fields":{"lat":38.761115860279894,"date":"10-12-2024","long":-9.404208606245472,"open":"Closed Event","host-name":null,"event-name":"Uma árvore para o futuro ","country-code":"PT","event_details":"<p>Quinta da Penha Longa is a property close to Sintra and Cascais, well known for its natural and built heritage, but also for including the Caesar Park Penha Longa Golf Resort Hotel and a set of residential areas. On the forest area of Quinta da Penha Longa, Caesar Park is developing an ambitious program of rewilding and control of invasive species. In 2023, Life Terra had the opportunity to organize, together with Caesar Park, a planting event associated with this program. </p><p></p><p>The idea that citizens should be involved in rewilding processes is the central idea of the Life Terra project. This is also the central idea of the event to be held on December 10th at Quinta da Penha Longa, where residents together with the company's employees will, once again, participate directly in the planting operations of native species included in the rewilding program. This event  will have the support of Cascais Ambiente, the environment agency of the Cascais municipality</p><p></p><p>The Caesar Park’s  transformative idea that the natural value of the forest space is an important dimension of the resort's quality, justifying relevant investments in its conservation, is also strongly associated with Life Terra's objectives and action in multiple areas in Europe.</p><p></p><p></p>","subscription_instructions":"<p></p>"}},{"id":9235,"name":"43rd Boranka Reforestation Event","slug":"43rd-Boranka-Reforestation-Event","tags":[61787,61807,191],"fields":{"lat":43.63727014775581,"date":"18-10-2024","long":15.955237749358545,"open":"Closed Event","host-name":"Boranka","event-name":"43rd Boranka Reforestation Event","country-code":"HR","event_details":"<p>Join Us for the 43rd Boranka Reforestation Action in Grebaštica!</p><p></p><p>We invite you to be part of a meaningful event where we come together to restore the wildfire-affected Jelinjak hill in Grebaštica. On this special day, we will plant oak, ash, cypress, and other native species to help regenerate the forest and combat the impacts of climate change.</p>","subscription_instructions":"<p></p>"}},{"id":9239,"name":"42nd Boranka Action - Abbott","slug":"42nd-Boranka-Action---Abbott","tags":[61787,61807,191],"fields":{"lat":43.63546321818603,"date":"18-10-2024","long":15.967431730560472,"open":"Closed Event","host-name":"Boranka","event-name":"42nd Boranka Action - Abbott","country-code":"HR","event_details":"<p>Planting event with Abbott. Working on reforestation in naturally degraded areas. Planning to plant saplings of holm oak, cypress, black ash, and Aleppo pine. </p>","subscription_instructions":"<p></p>"}},{"id":9244,"name":"Kishoge Community College Tree Planting","slug":"Kishoge-Community-College-Tree-Planting","tags":[61786,61807,372],"fields":{"lat":53.335897287013594,"date":"09-12-2024","long":-6.426959264215072,"open":"Open Event","host-name":"Stepping Stone Forests","event-name":"Kishoge Community College Tree Planting","country-code":"IE","event_details":"<p>Join us at 10am until 1pm to help plant 600S native Irish trees & shrubs. We'll provide all of the necessary equipment but do wear sturdy footwear and bring your own gloves.</p>","subscription_instructions":"<p>https://steppingstoneforests.org/events/</p>"}},{"id":9247,"name":"Family tree planting event","slug":"Family-tree-planting-event","tags":[61787,61807,724],"fields":{"lat":41.25891753493592,"date":"30-11-2024","long":1.8155012943615585,"open":"Open Event","host-name":"Stichting Life Terra","event-name":"Family tree planting event","country-code":"ES","event_details":"<p>Small planting with my family in Sant Pere de Ribes (south of Barcelona, Spain). Interested people welcome to join </p>","subscription_instructions":"<p>Send email to svenkallen ad gmail.com </p>"}}]}