{"tags":[{"id":7559,"name":"When","slug":"when","tags":[{"id":61786,"name":"Past","slug":"past","hidden":false},{"id":61787,"name":"Future","slug":"future","hidden":false}],"hidden":false},{"id":7558,"name":"Country","slug":"country","tags":[{"id":250,"name":"France","slug":"france","hidden":false},{"id":276,"name":"Germany","slug":"germany","hidden":false},{"id":528,"name":"Netherlands","slug":"netherlands","hidden":false},{"id":724,"name":"Spain","slug":"spain","hidden":false}],"hidden":false}],"items":[{"id":8707,"name":"Kicking off the planting season in Limburg with BLG!","slug":"Kicking-off-the-planting-season-in-Limburg-with-BLG!","tags":[61786,61807,528],"fields":{"lat":51.54898185296815,"date":"20-11-2024","long":6.022360741643017,"open":true,"host-name":"EU Tree planting day","event-name":"Kicking off the planting season in Limburg with BLG!","country-code":"NL","event_details":"<p>We will be planting trees with our partner BLG at Landgoed Geijsteren in Limburg. Our morning event will start with an introduction to reforestation and it's importance in fighting climate change, which we will conduct together with our planting partner Bosgroepen. Afterwards we will spend the rest of the morning to help Landgoed Geijsteren with their tree planting project!</p>","subscription_instructions":"<p></p>"}},{"id":8708,"name":"Morning tree planting in Limburg with Politie Nederland  ","slug":"Morning-tree-planting-in-Limburg-with-Politie-Nederland--","tags":[61786,61807,528],"fields":{"lat":51.54898185296815,"date":"21-11-2024","long":6.022360741643017,"open":true,"host-name":"Stichting Life Terra","event-name":"Morning tree planting in Limburg with Politie Nederland  ","country-code":"NL","event_details":"<p>Durhing this morning event we will be planting trees together with Politie Nederland at Landgoed Geijsteren in Limburg. Our event will start with an introduction to reforestation and it's importance in fighting climate change, which we will conduct together with our planting partner Bosgroepen. Afterwards we will spend the rest of the morning to help Landgoed Geijsteren with their tree planting project!</p>","subscription_instructions":"<p></p>"}},{"id":8710,"name":"Afternoon tree planting in Limburg with Politie Nederland","slug":"Afternoon-tree-planting-in-Limburg-with-Politie-Nederland","tags":[61786,61807,528],"fields":{"lat":51.54898185296815,"date":"21-11-2024","long":6.022360741643017,"open":true,"host-name":"EU Tree planting day","event-name":"Afternoon tree planting in Limburg with Politie Nederland","country-code":"NL","event_details":"<p>Durhing this afternoon event we will be planting trees together with Politie Nederland at Landgoed Geijsteren in Limburg. Our event will start with an introduction to reforestation and it's importance in fighting climate change, which we will conduct together with our planting partner Bosgroepen. Afterwards we will spend the rest of the afternoon to help Landgoed Geijsteren with their tree planting project!</p>","subscription_instructions":"<p></p>"}},{"id":8711,"name":"Morning tree planting event with EY ","slug":"Morning-tree-planting-event-with-EY-","tags":[61786,61807,528],"fields":{"lat":51.91012949666751,"date":"28-11-2024","long":5.215980987980487,"open":true,"host-name":"EU Tree planting day","event-name":"Morning tree planting event with EY ","country-code":"NL","event_details":"<p>During this morning event with EY we will be restoring an area that used to be monoculture forest and that was devastated by disease. We will start with an introduction on reforestation, why it is important and why we need to create a biodiverse forest on this location specifically. Afterwards, we will be working the rest of the morning to help create this new forest!</p>","subscription_instructions":"<p></p>"}},{"id":8713,"name":"Afternoon tree planting event with EY","slug":"Afternoon-tree-planting-event-with-EY","tags":[61786,61807,528],"fields":{"lat":51.91012949666751,"date":"28-11-2024","long":5.215980987980487,"open":true,"host-name":"Stichting Life Terra","event-name":"Afternoon tree planting event with EY","country-code":"NL","event_details":"<p>During this afternoon event with EY we will be restoring an area that used to be monoculture forest and that was devastated by disease. We will start with an introduction on reforestation, why it is important and why we need to create a biodiverse forest on this location specifically. Afterwards, we will be working the rest of the afternoon to help create this new forest!</p>","subscription_instructions":"<p></p>"}},{"id":8714,"name":"Planting trees with Tulpenrallye at Mariënwaerdt","slug":"Planting-trees-with-Tulpenrallye-at-Mariënwaerdt","tags":[61786,61807,528],"fields":{"lat":51.91012949666751,"date":"30-11-2024","long":5.215980987980487,"open":true,"host-name":"EU Tree planting day","event-name":"Planting trees with Tulpenrallye at Mariënwaerdt","country-code":"NL","event_details":"<p>During this event with Tulpenrallye we will be restoring an area that used to be monoculture forest and that was devastated by disease. We will start with an introduction on reforestation, why it is important and why we need to create a biodiverse forest on this location specifically. Afterwards, we will be working the rest of the morning to help create this new forest!</p>","subscription_instructions":"<p></p>"}},{"id":8719,"name":"Big Family Planting in Las Rozas 2024","slug":"Big-Family-Planting-in-Las-Rozas-2024","tags":[61786,61807,724],"fields":{"lat":40.504288687482116,"date":"19-10-2024","long":-3.8834174169159366,"open":true,"host-name":"Stichting Life Terra","event-name":"Big Family Planting in Las Rozas 2024","country-code":"ES","event_details":"<p>A new planting season starts and a new collaboration between Life Terra and Las Rozas Municipality is here! Like in previous years, the Big Family Planting will become the greatest reforestation initiative in Las Rozas, a free-to-access event in where families, friends and anyone who wishes to plant a tree and take climate action can join. </p><p></p><p>This year, partipicants will have the chance to choose between 14 different native species to plant! This mixture will help to enhance the biodiversity values in this area. Furthermore, cultural and environemntal education acts will happen at the \"Finca de la Talaverona\", where the Municipality holds a space with urban orchards and classrooms for environmental education purposes.</p><p></p><p>This 19th of October don't hesitate to join a planting initiative that, yet again, promises to be full of activities and opportunities to learn more about the importance of planting trees and shrubs. Furthermore, what better way to spend your day than being outdoors with friends and family getting your hands dirty and contributing to the Planet's health?</p><p></p><p>Hope to see you all there!</p>","subscription_instructions":"<p>People can join freely by attending the event during the designated hours. It starts at 10:00am and lasts for around 5 hours. Find more information in the Las Rozas Municipality webpage: https://www.lasrozas.es/node/10799</p>"}},{"id":8720,"name":"Training young Terra Leaders in Las Rozas","slug":"Training-young-Terra-Leaders-in-Las-Rozas","tags":[61786,61807,724],"fields":{"lat":40.504288687482116,"date":"19-10-2024","long":-3.8834174169159366,"open":true,"host-name":"Stichting Life Terra","event-name":"Training young Terra Leaders in Las Rozas","country-code":"ES","event_details":"<p>Properly planting a tree is no easy task! In Life Terra we firmly believe in environmental education, and an important part of it is to understand how a tree is planted and taken care of.</p><p></p><p>Because of this, every year we train Terra Leaders so this knowledge can be passed to future generations. Hopefully, this will be a skill that everyone will have in the near future.</p><p></p><p>This year we are involving the Young Volunteers of Las Rozas in a training activity so that they can help during the Big Family Planting on October 19th. Their help in-field is extremely valuable, and they can immediately put to practice their new planting skills!</p>","subscription_instructions":"<p></p>"}},{"id":8721,"name":"Planting with the Green Helmets Project in Las Rozas","slug":"Planting-with-the-Green-Helmets-Project-in-Las-Rozas","tags":[61786,61807,724],"fields":{"lat":40.504288687482116,"date":"22-10-2024","long":-3.8834174169159366,"open":true,"host-name":"Stichting Life Terra","event-name":"Planting with the Green Helmets Project in Las Rozas","country-code":"ES","event_details":"<p>This upcoming event in Las Rozas will unite Amazon employees and students from School Zola Las Rozas for a collaborative tree-planting initiative as part of the Cascos Verdes (Green Helmets) project, supported by Amazon. Inspired by the UN Blue Helmets, Cascos Verdes encourages citizens to take action for sustainability through reforestation and ecosystem restoration efforts.</p><p></p><p>During the event, volunteers will receive an introduction to the importance of tree planting and ecosystem protection, followed by a hands-on planting session. Participants will learn practical techniques, such as tree staking and protection, while engaging in meaningful environmental work. The day will conclude with an interactive environmental walk, designed to educate and inspire volunteers about local ecosystems and sustainability practices.</p><p></p><p>This initiative not only contributes to environmental restoration but also promotes education and awareness around climate change and ecosystem management.</p>","subscription_instructions":"<p></p>"}},{"id":8722,"name":"Adyen Paris tree planting event","slug":"Adyen-Paris-tree-planting-event","tags":[61786,61807,250],"fields":{"lat":48.540462352429714,"date":"27-11-2024","long":2.0475674756351796,"open":true,"host-name":"Stichting Life Terra","event-name":"Adyen Paris tree planting event","country-code":"FR","event_details":"<p>Life Terra now offers the unique opportunity to plant trees close to Paris. The 14th century castle “Ferme de Chateaupers” in Roinville is the venue where we'll be planting nearly 5,000 trees to help restore the land. The goal of the events is to plant a diverse mix of plant species inside and around the farm’s boundaries, as well as in some crop-field margins, to create windbreaks, biodiversity hubs, and new orchards. </p><p></p><p>The plantings will also be used to create “green infrastructure” to connect different pockets of forest and thus reconnect habitats. This will reinforce local biodiversity and enhance the resilience of the local ecosystem to extreme climatic events.</p><p></p><p>We'll kick off this project with the help of Adyen's Paris team, making France the 6th country (after Netherlands, Spain, Italy, UK and Sweden) for this internationally operating payment platform specialist. Let's plant!</p>","subscription_instructions":"<p></p>"}},{"id":8723,"name":"NVIDIA Tree Planting Day","slug":"NVIDIA-Tree-Planting-Day","tags":[61786,61807,276],"fields":{"lat":48.05857914282867,"date":"22-11-2024","long":11.574162205952073,"open":true,"host-name":"Stichting Life Terra","event-name":"NVIDIA Tree Planting Day","country-code":"DE","event_details":"<p>We are going to restore a forest area in order to contribute to Germany's ongoing silviculture conversion towards stronger climate resiliency. At this specific event, NVIDIANs from the Munich office have the opportunity to be part of Life Terra’s mission, planting trees with their colleagues and making a direct positive impact.</p>","subscription_instructions":"<p></p>"}},{"id":8725,"name":"One Tree Planted event with DLL near Den Bosch ","slug":"One-Tree-Planted-event-with-DLL-near-Den-Bosch-","tags":[61786,61807,528],"fields":{"lat":51.720485588871895,"date":"19-12-2024","long":5.38940006031182,"open":true,"host-name":"Stichting Life Terra","event-name":"One Tree Planted event with DLL near Den Bosch ","country-code":"NL","event_details":"<p></p>","subscription_instructions":"<p></p>"}}]}